In [6]:
import pandas as pd
import numpy as np

In [7]:
dates = pd.date_range('1/1/2000', periods=8)

In [8]:
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08'],
              dtype='datetime64[ns]', freq='D')

In [9]:
df = pd.DataFrame(np.random.randn(8, 4),index=dates, columns=['A', 'B', 'C', 'D'])

In [10]:
df

                   A         B         C         D
2000-01-01  0.462930 -0.205565 -0.199301 -1.332601
2000-01-02 -1.346112  0.812947 -0.873163 -0.550066
2000-01-03 -0.336829  0.692559  0.997651  1.604518
2000-01-04  0.314311  1.340488  0.747601 -1.195141
2000-01-05  1.063232  0.315927 -0.942217 -1.099510
2000-01-06  0.100811 -0.287126 -0.224357 -0.241774
2000-01-07  0.106068 -1.792690 -1.139977  0.367238
2000-01-08 -0.634260  0.760087 -0.549648 -1.356309

In [16]:
s=df['A']
s[-1]

-0.6342602046484224

In [17]:
df[['B', 'A']] = df[['A', 'B']]

In [18]:
df

                   A         B         C         D
2000-01-01 -0.205565  0.462930 -0.199301 -1.332601
2000-01-02  0.812947 -1.346112 -0.873163 -0.550066
2000-01-03  0.692559 -0.336829  0.997651  1.604518
2000-01-04  1.340488  0.314311  0.747601 -1.195141
2000-01-05  0.315927  1.063232 -0.942217 -1.099510
2000-01-06 -0.287126  0.100811 -0.224357 -0.241774
2000-01-07 -1.792690  0.106068 -1.139977  0.367238
2000-01-08  0.760087 -0.634260 -0.549648 -1.356309

In [33]:
x = pd.DataFrame({'x': [1, 2, 3], 'y': [3, 4, 5]})
x

   x  y
0  1  3
1  2  4
2  3  5

In [31]:
x.iloc[1]={'x':5,'y':1}

In [32]:
x

   x  y
0  1  3
1  5  1
2  3  5